src/C-C++/C++/C++11-features.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: C++11 New Features
#+OPTIONS: num:nil H:2

* =auto=
#+begin_src c++
  auto i = 42;        // i is an int
  auto l = 42LL;      // l is an long long
  auto p = new foo(); // p is a foo*

  std::map<std::string, std::vector<int>> map;
  for (auto it = begin(map); it != end(map); ++it) {
  }
#+end_src

=auto= 不能直接作为函数的返回类型,但可以通过尾随指定类型,如下:
#+begin_src c++
  template <typename T1, typename T2>
  auto compose(T1 t1, T2 t2) -> decltype(t1 + t2) {
    return t1+t2;
  }
  auto v = compose(2, 3.14); // v's type is double
#+end_src

* =nullptr=
0被用来表示null指针,所以有与整型的隐式转换的缺点. C++11中类
型是 =std::nullptr_t= 的 =nullptr= 来表示null指针. 隐式转换存在从
=nullptr= 到 任何类型的null指针,并且可以到 =bool= 类型(也就是 =false=
). 但是与整型的隐式转换不存在.向后兼容,0仍然是有效的null指针值.

#+begin_src c++
typedef decltype(nullptr) nullptr_t;
#+end_src

#+begin_src c++
  void foo(int* p) {}

  void bar(std::shared_ptr<int> p) {}

  int* p1 = NULL;
  int* p2 = nullptr;   
  if (p1 == p2) {
  }

  foo(nullptr);
  bar(nullptr);

  bool f = nullptr;
  int i = nullptr; // error: A native nullptr can only be converted to bool or, using reinterpret_cast, to an integral type
#+end_src
* loops
#+begin_src c++
#include <iostream>
#include <map>
#include <vector>
using namespace std;

int main() {
  std::map<std::string, std::vector<int>> map;
  std::vector<int> v;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);
  map["one"] = v;

  for (const auto& kvp : map) {
    std::cout << kvp.first << std::endl;

    for (auto v : kvp.second) {
      std::cout << v << std::endl;
    }
  }

  int arr[] = {1,2,3,4,5};
  for (int& e : arr) {
    e = e*e;
  }
  for (int& v : arr) {
    cout << v << endl;
  }
}
#+end_src
