public_html/C-C++/C++/C++11-features.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C++11 New Features</title>
<!-- 2015-04-12 Sun 19:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">C++11 New Features</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1"><code>auto</code></a></li>
<li><a href="#sec-2"><code>nullptr</code></a></li>
<li><a href="#sec-3">loops</a></li>
<li><a href="#sec-4">Override and final</a></li>
<li><a href="#sec-5">Strongly-typed enums</a></li>
<li><a href="#sec-6">Smart pointers</a>
<ul>
<li><a href="#sec-6-1"><code>unique_ptr</code></a></li>
<li><a href="#sec-6-2"><code>shared_ptr</code></a></li>
<li><a href="#sec-6-3"><code>weak_ptr</code></a></li>
</ul>
</li>
<li><a href="#sec-7">Lambdas</a></li>
<li><a href="#sec-8">non-member begin() and end()</a></li>
<li><a href="#sec-9">static<sub>assert</sub></a></li>
<li><a href="#sec-10">Variable Templates</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><code>auto</code></h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">i</span> = 42;        <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">i is an int</span>
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">l</span> = 42LL;      <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">l is an long long</span>
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">p</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">foo</span>(); <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">p is a foo*</span>

<span style="color: #7fffd4;">std</span>::map&lt;<span style="color: #7fffd4;">std</span>::string, <span style="color: #7fffd4;">std</span>::vector&lt;<span style="color: #98fb98;">int</span>&gt;&gt; map;
<span style="color: #00ffff;">for</span> (<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">it</span> = begin(map); it != end(map); ++it) {
}
</pre>
</div>

<p>
<code>auto</code> 不能直接作为函数的返回类型,但可以通过尾随指定类型,如下:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">T1</span>, <span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">T2</span>&gt;
<span style="color: #00ffff;">auto</span> <span style="color: #87cefa;">compose</span>(<span style="color: #98fb98;">T1</span> <span style="color: #eedd82;">t1</span>, <span style="color: #98fb98;">T2</span> <span style="color: #eedd82;">t2</span>) -&gt; decltype(t1 + t2) {
  <span style="color: #00ffff;">return</span> t1+t2;
}
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">v</span> = compose(2, 3.14); <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">v's type is double</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><code>nullptr</code></h2>
<div class="outline-text-2" id="text-2">
<p>
0被用来表示null指针,所以有与整型的隐式转换的缺点. C++11中类型是 <code>std::nullptr_t</code> 的 <code>nullptr</code> 来表示null指针. 隐式转换存在从
<code>nullptr</code> 到 任何类型的null指针,并且可以到 <code>bool</code> 类型(也就是 <code>false</code>
). 但是与整型的隐式转换不存在.向后兼容,0仍然是有效的null指针值.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">decltype</span>(<span style="color: #98fb98;">nullptr</span>) nullptr_t;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span>(<span style="color: #98fb98;">int</span>* <span style="color: #eedd82;">p</span>) {}

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">bar</span>(<span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p</span>) {}

<span style="color: #98fb98;">int</span>* <span style="color: #eedd82;">p1</span> = <span style="color: #7fffd4;">NULL</span>;
<span style="color: #98fb98;">int</span>* <span style="color: #eedd82;">p2</span> = nullptr;   
<span style="color: #00ffff;">if</span> (p1 == p2) {
}

foo(nullptr);
bar(nullptr);

<span style="color: #98fb98;">bool</span> <span style="color: #eedd82;">f</span> = nullptr;
<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">i</span> = nullptr; <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">error: A native nullptr can only be converted to bool or, using reinterpret_cast, to an integral type</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">loops</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;map&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;vector&gt;</span>
<span style="color: #00ffff;">using</span> <span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span>;

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #7fffd4;">std</span>::map&lt;<span style="color: #7fffd4;">std</span>::string, <span style="color: #7fffd4;">std</span>::vector&lt;<span style="color: #98fb98;">int</span>&gt;&gt; map;
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">vector</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">v</span>;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);
  <span style="color: #98fb98;">map</span>[<span style="color: #ffa07a;">"one"</span>] = v;

  <span style="color: #00ffff;">for</span> (<span style="color: #00ffff;">const</span> <span style="color: #00ffff;">auto</span>&amp; kvp : map) {
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; kvp.first &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

    <span style="color: #00ffff;">for</span> (<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">v</span> : kvp.second) {
      <span style="color: #7fffd4;">std</span>::cout &lt;&lt; v &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
    }
  }

  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">arr</span>[] = {1,2,3,4,5};
  <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span>&amp; <span style="color: #eedd82;">e</span> : arr) {
    e = e*e;
  }
  <span style="color: #00ffff;">for</span> (<span style="color: #98fb98;">int</span>&amp; <span style="color: #eedd82;">v</span> : arr) {
    cout &lt;&lt; v &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
