src/C-C++/C++/C++11-features.org
* Override and final
在多类中实现多态时,需要使用 =virtual= 关键字来实现,并且要通过类层次来
确定是否覆盖成功,或者想覆盖却函数声明有一些不同等不易发现的错误,如下:

#+begin_src c++
  class B 
  {
   public:
    virtual void f(short) {std::cout << "B::f" << std::endl;}
  };

  class D : public B
  {
   public:
    virtual void f(int) {std::cout << "D::f" << std::endl;}
  };
#+end_src

本意想 =D::f= 覆盖 =B::f=,但是它们的参数不同,使得覆盖失败, =B::f= 仅仅
是另外个虚函数.

另外如下的小错误,在基类中,函数被 =const= 标识,但继承类中的却没有.所以
基类的虚函数不会被继承类的覆盖.
#+begin_src c++
  class B 
  {
   public:
     virtual void f(int) const {std::cout << "B::f " << std::endl;}
  };

  class D : public B
  {
   public:
     virtual void f(int) {std::cout << "D::f" << std::endl;}
  };
#+end_src

在C++11中可以显示的描述你的多态目的. =override= 表明一个方法是基类虚函
数的覆盖, =final= 表明虚函数不能覆盖此表示的函数.

如下例子,意图 =D::f= 覆盖基类的 =B::F=:

#+begin_src c++
#include <iostream>
using namespace std;

class B {
 public:
  virtual void f(short) {std::cout << "B::f" << std::endl;}
};

class D : public B {
 public:
  virtual void f(int) override {std::cout << "D::f" << std::endl;}
};

int main() {
  B* base = new D();
}
#+end_src

编译,出现如下错误:
#+begin_src sh
./overrride.cc:11:16: error: ‘virtual void D::f(int)’ marked override, but does not override
#+end_src

如下例子,意图 =D::f= 不让之后的继承类的函数覆盖:
#+begin_src c++
#include <iostream>
using namespace std;

class B  {
 public:
   virtual void f(int) {std::cout << "B::f" << std::endl;}
};

class D : public B {
 public:
   virtual void f(int) override final {std::cout << "D::f" << std::endl;}
};

class F : public D {
 public:
   virtual void f(int) override {std::cout << "F::f" << std::endl;}
};


int main() {
  B* base = new F();
  return 0;
}
#+end_src

编译,出现如下错误:
#+begin_src sh
./final.cc:16:17: error: virtual function ‘virtual void F::f(int)’
./final.cc:11:17: error: overriding final function ‘virtual void D::f(int)’
#+end_src
* Strongly-typed enums
传统的C++的enum有一些弊端: enumerators被暴露在所在的范围,如果同一范围
定义的enumerators拥有相同的名字,那么就会造成命名冲突,并且它们隐式的被
转换为整型.

C++11引入新的enums类别,叫做 strongly-typed enums. 由 =enum class= 特定.
它们不在把enumerators暴露到所在代码范围,并不在隐式转换成整型,如下:

#+begin_src c++
enum class Options {None, One, All};
Options o = Options::All;
#+end_src
* Smart pointers
C++11中引入如下三种smart pointer, 在头文件 =<memory>= 中:

+ [[http://en.cppreference.com/w/cpp/memory/unique_ptr][ =unique_ptr= ]]: 当内存资源不可共享时使用(没有copy constructor),但可
  以转移给另一个 =unique_ptr=.
+ [[http://en.cppreference.com/w/cpp/memory/shared_ptr][ =shared_ptr= ]]: 当拥有的内存资源可共享时使用.
+ [[http://en.cppreference.com/w/cpp/memory/weak_ptr/lock][ =weak_ptr= ]]: 拥有对由 =shared_ptr= 管理的对象的reference,但不对
  reference count影响.

** =unique_ptr=
=unique_ptr= 之间对对象的拥有权的转让通过 =std::move= 操作, 被转让的
=unique_ptr= 成为 null, =get()= 操作返回 =nullptr=.

#+begin_src c++
#include <iostream>
#include <memory>

void foo (int* p) {
   std::cout << *p << std::endl;
}

int main() {
  std::unique_ptr<int> p1(new int(42));
  std::unique_ptr<int> p2 = std::move(p1); // transfer ownership
  
  if (p1) {
    foo(p1.get());
  } else {
    std::cout << "p1 is null" << std::endl;
  }

  (*p2)++;

  if(p2)
    foo(p2.get());
  return 0;
}
#+end_src

