public_html/C-C++/C++/C++11-features.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Override and final</h2>
<div class="outline-text-2" id="text-4">
<p>
在多类中实现多态时,需要使用 <code>virtual</code> 关键字来实现,并且要通过类层次来确定是否覆盖成功,或者想覆盖却函数声明有一些不同等不易发现的错误,如下:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">B</span> 
{
 <span style="color: #00ffff;">public</span>:
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">short</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"B::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">D</span> : <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">B</span>
{
 <span style="color: #00ffff;">public</span>:
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"D::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};
</pre>
</div>

<p>
本意想 <code>D::f</code> 覆盖 <code>B::f</code>,但是它们的参数不同,使得覆盖失败, <code>B::f</code> 仅仅是另外个虚函数.
</p>

<p>
另外如下的小错误,在基类中,函数被 <code>const</code> 标识,但继承类中的却没有.所以基类的虚函数不会被继承类的覆盖.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">class</span> <span style="color: #98fb98;">B</span> 
{
 <span style="color: #00ffff;">public</span>:
   <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) <span style="color: #00ffff;">const</span> {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"B::f "</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">D</span> : <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">B</span>
{
 <span style="color: #00ffff;">public</span>:
   <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"D::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};
</pre>
</div>

<p>
在C++11中可以显示的描述你的多态目的. <code>override</code> 表明一个方法是基类虚函数的覆盖, <code>final</code> 表明虚函数不能覆盖此表示的函数.
</p>

<p>
如下例子,意图 <code>D::f</code> 覆盖基类的 <code>B::F</code>:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #00ffff;">using</span> <span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span>;

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">B</span> {
 <span style="color: #00ffff;">public</span>:
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">short</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"B::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">D</span> : <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">B</span> {
 <span style="color: #00ffff;">public</span>:
  <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) override {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"D::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #98fb98;">B</span>* <span style="color: #eedd82;">base</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">D</span>();
}
</pre>
</div>

<p>
编译,出现如下错误:
</p>
<div class="org-src-container">

<pre class="src src-sh">./overrride.cc:11:16: error: &#8216;virtual void D::f(int)&#8217; marked override, but does not override
</pre>
</div>

<p>
如下例子,意图 <code>D::f</code> 不让之后的继承类的函数覆盖:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #00ffff;">using</span> <span style="color: #00ffff;">namespace</span> <span style="color: #7fffd4;">std</span>;

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">B</span>  {
 <span style="color: #00ffff;">public</span>:
   <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"B::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">D</span> : <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">B</span> {
 <span style="color: #00ffff;">public</span>:
   <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) <span style="color: #98fb98;">override</span> <span style="color: #eedd82;">final</span> {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"D::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};

<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">F</span> : <span style="color: #00ffff;">public</span> <span style="color: #98fb98;">D</span> {
 <span style="color: #00ffff;">public</span>:
   <span style="color: #00ffff;">virtual</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">f</span>(<span style="color: #98fb98;">int</span>) override {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"F::f"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;}
};


<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #98fb98;">B</span>* <span style="color: #eedd82;">base</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">F</span>();
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>

<p>
编译,出现如下错误:
</p>
<div class="org-src-container">

<pre class="src src-sh">./final.cc:16:17: error: virtual <span style="color: #00ffff;">function</span> &#8216;virtual void F::f(int)&#8217;
./final.cc:11:17: error: overriding final <span style="color: #00ffff;">function</span> &#8216;virtual void D::f(int)&#8217;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Strongly-typed enums</h2>
<div class="outline-text-2" id="text-5">
<p>
传统的C++的enum有一些弊端: enumerators被暴露在所在的范围,如果同一范围定义的enumerators拥有相同的名字,那么就会造成命名冲突,并且它们隐式的被转换为整型.
</p>

<p>
C++11引入新的enums类别,叫做 strongly-typed enums. 由 <code>enum class</code> 特定.
它们不在把enumerators暴露到所在代码范围,并不在隐式转换成整型,如下:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">enum</span> <span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Options</span> {<span style="color: #eedd82;">None</span>, <span style="color: #eedd82;">One</span>, <span style="color: #eedd82;">All</span>};
<span style="color: #98fb98;">Options</span> <span style="color: #eedd82;">o</span> = <span style="color: #7fffd4;">Options</span>::All;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Smart pointers</h2>
<div class="outline-text-2" id="text-6">
<p>
C++11中引入如下三种smart pointer, 在头文件 <code>&lt;memory&gt;</code> 中:
</p>

<ul class="org-ul">
<li><a href="http://en.cppreference.com/w/cpp/memory/unique_ptr"> <code>unique_ptr</code> </a>: 当内存资源不可共享时使用(没有copy constructor),但可以转移给另一个 <code>unique_ptr</code>.
</li>
<li><a href="http://en.cppreference.com/w/cpp/memory/shared_ptr"> <code>shared_ptr</code> </a>: 当拥有的内存资源可共享时使用.
</li>
<li><a href="http://en.cppreference.com/w/cpp/memory/weak_ptr/lock"> <code>weak_ptr</code> </a>: 拥有对由 <code>shared_ptr</code> 管理的对象的reference,但不对
reference count影响.
</li>
</ul>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><code>unique_ptr</code></h3>
<div class="outline-text-3" id="text-6-1">
<p>
<code>unique_ptr</code> 之间对对象的拥有权的转让通过 <code>std::move</code> 操作, 被转让的
<code>unique_ptr</code> 成为 null, <code>get()</code> 操作返回 <code>nullptr</code>.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;memory&gt;</span>

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span> (<span style="color: #98fb98;">int</span>* <span style="color: #eedd82;">p</span>) {
   <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *p &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
}

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">unique_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p1</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">int</span>(42));
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">unique_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p2</span> = <span style="color: #7fffd4;">std</span>::move(p1); <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">transfer ownership</span>

  <span style="color: #00ffff;">if</span> (p1) {
    foo(p1.get());
  } <span style="color: #00ffff;">else</span> {
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"p1 is null"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
  }

  (*p2)++;

  <span style="color: #00ffff;">if</span>(p2)
    foo(p2.get());
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>
</div>
</div>
