src/C-C++/C++/C++11-features.org
** =shared_ptr=
#+begin_src c++
#include <iostream>
#include <memory>

void foo(int* p) {
  std::cout << "foo: " << *p << std::endl;
}
void bar(std::shared_ptr<int> p) {
  ++(*p);
}

int main() {
  std::shared_ptr<int> p1(new int(42));
  std::shared_ptr<int> p2 = p1;
  
  bar(p1);
  foo(p2.get());
  return 0;
}

#+end_src

第一句创建 =p1= 也可以写成如下:
#+begin_src c++
auto p1 = std::make_shared<int>(42);
#+end_src

=make_shared= 不是成员函数,具有为共享对象和智能指针分配一步分配完成的
优势.而显示的创建 =shared_ptr= 通过构造对象需要两步分配来完成.除了可能
的多余开销,并可能在某些情况下造成memory leaks.如下例子,若 =seed()=
throw错误,那么有可能发生memory leaks.

#+begin_src c++
  void foo(std::shared_ptr<int> p, int init) {
     *p = init;
  }
  foo(std::shared_ptr<int>(new int(42)), seed());
#+end_src

** =weak_ptr=
=weak_ptr= 通过 =lock()= 操作获得此对象的 =shared_ptr= .

#+begin_src c++
#include <iostream>
#include <memory>

int main() {
  auto p = std::make_shared<int>(42);
  std::weak_ptr<int> wp = p;
  {
    auto sp = wp.lock();
    std::cout << *sp << std::endl;
  }
  p.reset();
  
  if(wp.expired())
    std::cout << "expired" << std::endl;
}
#+end_src
* Lambdas
C++11中引入了functional programming的lambda特性, 你能使用lambda当需要
function object或function或 =std::function= .如下例子:
#+begin_src c++
#include <iostream>
#include <vector>
#include <algorithm>

int main() {
  std::vector<int> v;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);

  std::for_each(std::begin(v), std::end(v),
                [](int n) {std::cout << n << std::endl;});

  auto is_odd = [](int n) {return n % 2 == 1;};
  auto pos = std::find_if(std::begin(v), std::end(v), is_odd);
  if (pos != std::end(v))
    std::cout << *pos << std::endl;
  return 0;
}
#+end_src

并且可以递归形式的lambda,但如果是哟功能 =auto= 来声明递归lambda会有如
下错误:
#+begin_src c++
auto fib = [&fib](int n) {return n < 2 ? 1 : fib(n-1) + fib(n-2);};
#+end_src

#+begin_src sh
./lambdas.cc: In lambda function:
./lambdas.cc:19:55: error: ‘fib’ cannot be used as a function
./lambdas.cc:19:66: error: ‘fib’ cannot be used as a function
./lambdas.cc:19:68: error: return-statement with a value, in function returning 'void' [-fpermissive]
./lambdas.cc: In function ‘int main()’:
./lambdas.cc:19:68: error: variable ‘auto fib’ with ‘auto’ type used in its own initializer
#+end_src

问题是, =auto= 意味着对象的类型由它的初始化决定,但是初始化中却包含自己
的引用,需要知道它自己的类型,那么就一个循环问题,不知道这个对象的类型了.

所以用如下指定函数的类型:

#+begin_src c++
std::function<int(int)>  fib =
      [&fib](int n) {return n < 2 ? 1 : fib(n-1) + fib(n-2);};
#+end_src
