public_html/C-C++/C++/C++11-features.html

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><code>shared_ptr</code></h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;memory&gt;</span>

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span>(<span style="color: #98fb98;">int</span>* <span style="color: #eedd82;">p</span>) {
  <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"foo: "</span> &lt;&lt; *p &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
}
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">bar</span>(<span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p</span>) {
  ++(*p);
}

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p1</span>(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">int</span>(42));
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p2</span> = p1;

  bar(p1);
  foo(p2.get());
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>

<p>
第一句创建 <code>p1</code> 也可以写成如下:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">p1</span> = <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">make_shared</span>&lt;<span style="color: #98fb98;">int</span>&gt;(42);
</pre>
</div>

<p>
<code>make_shared</code> 不是成员函数,具有为共享对象和智能指针分配一步分配完成的优势.而显示的创建 <code>shared_ptr</code> 通过构造对象需要两步分配来完成.除了可能的多余开销,并可能在某些情况下造成memory leaks.如下例子,若 <code>seed()</code>
throw错误,那么有可能发生memory leaks.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span>(<span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">p</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">init</span>) {
   *p = init;
}
foo(<span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">shared_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt;(<span style="color: #00ffff;">new</span> <span style="color: #98fb98;">int</span>(42)), seed());
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><code>weak_ptr</code></h3>
<div class="outline-text-3" id="text-6-3">
<p>
<code>weak_ptr</code> 通过 <code>lock()</code> 操作获得此对象的 <code>shared_ptr</code> .
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;memory&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">p</span> = <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">make_shared</span>&lt;<span style="color: #98fb98;">int</span>&gt;(42);
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">weak_ptr</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">wp</span> = p;
  {
    <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">sp</span> = wp.lock();
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *sp &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
  }
  p.reset();

  <span style="color: #00ffff;">if</span>(wp.expired())
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; <span style="color: #ffa07a;">"expired"</span> &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Lambdas</h2>
<div class="outline-text-2" id="text-7">
<p>
C++11中引入了functional programming的lambda特性, 你能使用lambda当需要
function object或function或 <code>std::function</code> .如下例子:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;vector&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;algorithm&gt;</span>

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">vector</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">v</span>;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);

  <span style="color: #7fffd4;">std</span>::for_each(<span style="color: #7fffd4;">std</span>::begin(v), <span style="color: #7fffd4;">std</span>::end(v),
                [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; n &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;});

  <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">is_odd</span> = [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n % 2 == 1;};
  <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">pos</span> = <span style="color: #7fffd4;">std</span>::find_if(<span style="color: #7fffd4;">std</span>::begin(v), <span style="color: #7fffd4;">std</span>::end(v), is_odd);
  <span style="color: #00ffff;">if</span> (pos != <span style="color: #7fffd4;">std</span>::end(v))
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *pos &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>

<p>
并且可以递归形式的lambda,但如果是哟功能 <code>auto</code> 来声明递归lambda会有如下错误:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">fib</span> = [&amp;fib](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n &lt; 2 ? 1 : fib(n-1) + fib(n-2);};
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">./lambdas.cc: In lambda <span style="color: #00ffff;">function</span>:
./lambdas.cc:19:55: error: &#8216;fib&#8217; cannot be used as a <span style="color: #00ffff;">function</span>
./lambdas.cc:19:66: error: &#8216;fib&#8217; cannot be used as a <span style="color: #00ffff;">function</span>
./lambdas.cc:19:68: error: return-statement with a value,<span style="color: #00ffff;"> in</span> <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">returning</span> <span style="color: #ffa07a;">'void'</span> [-fpermissive]
./lambdas.cc: In <span style="color: #00ffff;">function</span> &#8216;int main()&#8217;:
./lambdas.cc:19:68: error: variable &#8216;auto fib&#8217; with &#8216;auto&#8217; type used<span style="color: #00ffff;"> in</span> its own initializer
</pre>
</div>

<p>
问题是, <code>auto</code> 意味着对象的类型由它的初始化决定,但是初始化中却包含自己的引用,需要知道它自己的类型,那么就一个循环问题,不知道这个对象的类型了.
</p>

<p>
所以用如下指定函数的类型:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">function</span>&lt;<span style="color: #98fb98;">int</span>(<span style="color: #98fb98;">int</span>)&gt;  <span style="color: #eedd82;">fib</span> =
      [&amp;fib](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n &lt; 2 ? 1 : fib(n-1) + fib(n-2);};
</pre>
</div>
</div>
</div>
