src/C-C++/C++/C++11-features.org
* non-member begin() and end()
C++11中提供了函数 =begin()= 和 =end()= ,很方便的获得 STL containers的
begin和end点,而且同样适用于C的arrays.

如果不用 =begin()= 和 =end()= ,那么对C的arrays可以如下操作:

#+begin_src c++
  int arr[] = {1,2,3};
  std::for_each(&arr[0], &arr[0]+sizeof(arr)/sizeof(arr[0]),
                [](int n) {std::cout << n << std::endl;});

  auto is_odd = [](int n) {return n%2==1;};
  auto begin = &arr[0];
  auto end = &arr[0]+sizeof(arr)/sizeof(arr[0]);
  auto pos = std::find_if(begin, end, is_odd);
  if(pos != end)
    std::cout << *pos << std::endl;
#+end_src
使用 =begin()= 和 =end()=:
#+begin_src c++
  int arr[] = {1,2,3};
  std::for_each(std::begin(arr), std::end(arr),
                [](int n) {std::cout << n << std::endl;});

  auto is_odd = [](int n) {return n%2==1;};
  auto pos = std::find_if(std::begin(arr), std::end(arr), is_odd);
  if(pos != std::end(arr))
    std::cout << *pos << std::endl;
#+end_src

与STL containers的操作类似,可以整合成:
#+begin_src c++
#include <iostream>
#include <algorithm>

template <typename Iterator>
void bar(Iterator begin, Iterator end)  {
  std::for_each(begin, end, [](int n) {std::cout << n << std::endl;});
  
  auto is_odd = [](int n) {return n%2==1;};
  auto pos = std::find_if(begin, end, is_odd);
  if(pos != end)
    std::cout << *pos << std::endl;
}

template <typename C>
void foo(C c) {
  bar(std::begin(c), std::end(c));
}

template <typename T, size_t N>
void foo(T(&arr)[N]) {
  bar(std::begin(arr), std::end(arr));
}

int main() {
  int arr[] = {1,2,3};
  foo(arr);

  std::vector<int> v;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);
  foo(v);
  return 0;
}
#+end_src
* static_assert
=static_assert= 可以用来在compile时进行assertion.

#+begin_src c++
template <typename T, size_t Size>
class Vector {
  static_assert(Size < 3, "Size is too small");
  T _points[Size];
};

int main()
{
  Vector<int, 16> a1;
  Vector<double, 2> a2;
  return 0;
}
#+end_src

产生如下错误:
#+begin_src sh
./static_assert.cc: In instantiation of ‘class Vector<int, 16u>’:
./static_assert.cc:12:20:   required from here
./static_assert.cc:6:4: error: static assertion failed: Size is too small
#+end_src
