public_html/C-C++/C++/C++11-features.html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">non-member begin() and end()</h2>
<div class="outline-text-2" id="text-8">
<p>
C++11中提供了函数 <code>begin()</code> 和 <code>end()</code> ,很方便的获得 STL containers的
begin和end点,而且同样适用于C的arrays.
</p>

<p>
如果不用 <code>begin()</code> 和 <code>end()</code> ,那么对C的arrays可以如下操作:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">int</span> <span style="color: #eedd82;">arr</span>[] = {1,2,3};
<span style="color: #7fffd4;">std</span>::for_each(&amp;arr[0], &amp;arr[0]+<span style="color: #00ffff;">sizeof</span>(arr)/<span style="color: #00ffff;">sizeof</span>(arr[0]),
              [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; n &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;});

<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">is_odd</span> = [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n%2==1;};
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">begin</span> = &amp;arr[0];
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">end</span> = &amp;arr[0]+<span style="color: #00ffff;">sizeof</span>(arr)/<span style="color: #00ffff;">sizeof</span>(arr[0]);
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">pos</span> = <span style="color: #7fffd4;">std</span>::find_if(begin, end, is_odd);
<span style="color: #00ffff;">if</span>(pos != end)
  <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *pos &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
</pre>
</div>
<p>
使用 <code>begin()</code> 和 <code>end()</code>:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #98fb98;">int</span> <span style="color: #eedd82;">arr</span>[] = {1,2,3};
<span style="color: #7fffd4;">std</span>::for_each(<span style="color: #7fffd4;">std</span>::begin(arr), <span style="color: #7fffd4;">std</span>::end(arr),
              [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; n &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;});

<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">is_odd</span> = [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n%2==1;};
<span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">pos</span> = <span style="color: #7fffd4;">std</span>::find_if(<span style="color: #7fffd4;">std</span>::begin(arr), <span style="color: #7fffd4;">std</span>::end(arr), is_odd);
<span style="color: #00ffff;">if</span>(pos != <span style="color: #7fffd4;">std</span>::end(arr))
  <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *pos &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
</pre>
</div>

<p>
与STL containers的操作类似,可以整合成:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;iostream&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;algorithm&gt;</span>

<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">Iterator</span>&gt;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">bar</span>(<span style="color: #98fb98;">Iterator</span> <span style="color: #eedd82;">begin</span>, <span style="color: #98fb98;">Iterator</span> <span style="color: #eedd82;">end</span>)  {
  <span style="color: #7fffd4;">std</span>::for_each(begin, end, [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #7fffd4;">std</span>::cout &lt;&lt; n &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;});

  <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">is_odd</span> = [](<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">n</span>) {<span style="color: #00ffff;">return</span> n%2==1;};
  <span style="color: #00ffff;">auto</span> <span style="color: #98fb98;">pos</span> = <span style="color: #7fffd4;">std</span>::find_if(begin, end, is_odd);
  <span style="color: #00ffff;">if</span>(pos != end)
    <span style="color: #7fffd4;">std</span>::cout &lt;&lt; *pos &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;
}

<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">C</span>&gt;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span>(<span style="color: #98fb98;">C</span> <span style="color: #eedd82;">c</span>) {
  bar(<span style="color: #7fffd4;">std</span>::begin(c), <span style="color: #7fffd4;">std</span>::end(c));
}

<span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">N</span>&gt;
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">foo</span>(<span style="color: #98fb98;">T</span>(&amp;<span style="color: #eedd82;">arr</span>)[N]) {
  bar(<span style="color: #7fffd4;">std</span>::begin(arr), <span style="color: #7fffd4;">std</span>::end(arr));
}

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">arr</span>[] = {1,2,3};
  foo(arr);

  <span style="color: #7fffd4;">std</span>::<span style="color: #98fb98;">vector</span>&lt;<span style="color: #98fb98;">int</span>&gt; <span style="color: #eedd82;">v</span>;
  v.push_back(1);
  v.push_back(2);
  v.push_back(3);
  foo(v);
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">static<sub>assert</sub></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>static_assert</code> 可以用来在compile时进行assertion.
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #00ffff;">template</span> &lt;<span style="color: #00ffff;">typename</span> <span style="color: #98fb98;">T</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">Size</span>&gt;
<span style="color: #00ffff;">class</span> <span style="color: #98fb98;">Vector</span> {
  static_assert(Size &lt; 3, <span style="color: #ffa07a;">"Size is too small"</span>);
  <span style="color: #98fb98;">T</span> <span style="color: #eedd82;">_points</span>[Size];
};

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>()
{
  <span style="color: #98fb98;">Vector</span>&lt;<span style="color: #98fb98;">int</span>, 16&gt; <span style="color: #eedd82;">a1</span>;
  <span style="color: #98fb98;">Vector</span>&lt;<span style="color: #98fb98;">double</span>, 2&gt; <span style="color: #eedd82;">a2</span>;
  <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>

<p>
产生如下错误:
</p>
<div class="org-src-container">

<pre class="src src-sh">./static_assert.cc: In instantiation of &#8216;class Vector&lt;int, 16u&gt;&#8217;:
./static_assert.cc:12:20:   required from here
./static_assert.cc:6:4: error: static assertion failed: Size is too small
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Variable Templates</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2015-04-12 Sun 19:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
